Revit 2024 API
LineLightShape Members
The LineLightShape type exposes the following members.
Constructors
Name | Description
LineLightShape()
 Creates a line light shape object with 2.0' emit length.
LineLightShape(Double)
 Creates a line light shape object with the given emit length.
LineLightShape(LineLightShape)
 Creates a copy of the given line light shape
Methods
Name | Description
Clone
 Creates a copy of the LightShape derived object.
 (Inherited from LightShape.)
Dispose |  (Inherited from LightShape.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
EmitLength
 The emit length.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightShape.)
See Also
LineLightShape Class
Autodesk.Revit.DB.Lighting Namespace